Deep-Learning/NVIDIA-Dynamo-Agentic-Inference/data/benchmark_32b_D1_docker_baseline.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='', model='/models/Qwen2.5-32B-Instruct', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=256, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=10.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='', model='/models/Qwen2.5-32B-Instruct', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=256, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=10.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 50561
#Output tokens: 12508
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 100/100 [00:16<00:00,  6.01it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    10.0      
Max request concurrency:                 not set   
Successful requests:                     100       
Benchmark duration (s):                  16.67     
Total input tokens:                      50561     
Total input text tokens:                 50561     
Total generated tokens:                  12508     
Total generated tokens (retokenized):    12508     
Request throughput (req/s):              6.00      
Input token throughput (tok/s):          3033.32   
Output token throughput (tok/s):         750.40    
Peak output token throughput (tok/s):    2235.00   
Peak concurrent requests:                90        
Total token throughput (tok/s):          3783.71   
Concurrency:                             45.26     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   7544.86   
Median E2E Latency (ms):                 7245.49   
P90 E2E Latency (ms):                    12316.73  
P99 E2E Latency (ms):                    13923.24  
---------------Time to First Token----------------
Mean TTFT (ms):                          325.88    
Median TTFT (ms):                        298.15    
P99 TTFT (ms):                           632.15    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          93.36     
Median TPOT (ms):                        56.58     
P99 TPOT (ms):                           474.05    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           58.18     
Median ITL (ms):                         32.28     
P95 ITL (ms):                            258.65    
P99 ITL (ms):                            391.02    
Max ITL (ms):                            1540.71   
==================================================